Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionFormatAttributes.Unit Property
 Gets or sets the unit of the dimension. Changing this attribute does not have any effect if the dimension measures an angle.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionSetBaseAttributes.DimensionValueUnits Unit { get; set; }
Public Property Unit As DimensionSetBaseAttributes.DimensionValueUnits
	Get
	Set
Property Value
Type: DimensionSetBaseAttributes.DimensionValueUnits
See Also
Reference
DimensionSetBaseAttributes.DimensionFormatAttributes Class
Tekla.Structures.Drawing Namespace